rails/app/controllers/authors_controller.rb

SELECT * FROM `authors`
---
  def index
    @authors = Author.all

SELECT * FROM `authors` WHERE (`authors`.`id` = 1)
---
  def show
    @author = Author.find(params[:id])

SELECT * FROM `authors` WHERE (`authors`.`id` = 1)
---
  def edit
    @author = Author.find(params[:id])

INSERT INTO `authors` (`city`, `region`, `school`, `grade`, `created_at`, `country`, `image_url`, `updated_at`, `major`, `type`, `last_name`, `summary`, `first_name`, `state`) VALUES('los angeles', '', 'University of Southern California', 'Master', '2010-06-01 06:48:02', 'USA', 'http://tizianoproject.org/images/bio/bio', '2010-06-01 06:48:02', 'Journalism', NULL, 'mendez', 'Chris Mendez is currently a Web Applications Developer for the University of Southern California. He is interested in all areas of usability and experience design, from social interoperability to user collaboration. Chris has contributed to many online projects including multimedia packages for LaTimes.com and ChannelOne.com.\r\n\r\nChris is currently earning a master\'s degree in Communication Management from the Annenberg School for Communication from the University of Southern California with concentrations in web marketing and management.\r\n\r\nIn his free time Chris enjoys recording and producing music as well as traveling to remote destinations.', 'chris', NULL)
---
  def create
    @author = Author.new(params[:author])

    respond_to do |format|
      if @author.save

SELECT * FROM `authors` WHERE (`authors`.`id` = 1)
UPDATE `authors` SET `updated_at` = '2010-06-01 15:59:33', `image_url` = 'http://tizianoproject.org/images/bio/bio-chris.jpg' WHERE `id` = 1
---
  def update
    @author = Author.find(params[:id])

    respond_to do |format|
      if @author.update_attributes(params[:author])