rails/app/controllers/stories_controller.rb

SELECT * FROM `stories`
---
  def index
    @stories = Story.all

SELECT * FROM `stories` WHERE (`stories`.`id` = 1)
---
  def show

    @story = Story.find(params[:id])

SELECT * FROM `stories` WHERE (`stories`.`id` = 1)
---
  def edit
    @story = Story.find(params[:id])

INSERT INTO `stories` (`permalink`, `created_at`, `title`, `subhead`, `updated_at`, `headline`, `text`, `author_id`) VALUES('my-first-story-entry', '2010-06-01 18:24:52', 'my first story entry', 'check it out', '2010-06-01 18:24:52', 'my first story entry', 'my first story entrymy first story entrymy first story entrymy first story entrymy first story entrymy first story entrymy first story entrymy first story entry', 1)
---
  def create
    @story = Story.new( params[:story] )

    respond_to do |format|
      if @story.save

SELECT * FROM `stories` WHERE (`stories`.`id` = 1)
DELETE FROM `stories` WHERE `id` = 1
---
  def destroy
    @story = Story.find(params[:id])
    @story.destroy